# -*- coding: utf-8 -*-
"""
@author: YanWJ
@Date    : 2023/1/4
@Time    : 16:31
@File    : test.py
@Function: XX
@Other: XX
"""
import json
import requests
from tqdm import tqdm


def server_test(sen):
    sess_web = requests.Session()
    # noinspection PyBroadException
    try:
        req = requests.Request('POST', url=url, data=sen.encode("utf-8"))
        prep = sess_web.prepare_request(req)
        results = sess_web.send(prep, stream=False).text
    except Exception as e:
        results = str(e)
    return results


if __name__ == '__main__':
    url = 'http://10.17.107.66:12004/prediction'
    # url = 'http://10.17.107.61:8100'
    # url = 'http://10.17.105.51:8102/'
    text = "废气排放二零二六年底前NOx排放减少3%二零二六年底前SOx排放减少3%二零二六年底前PM排放减少3%GHG排放二零二六年底前范围1排放减少3%二零二六年底前范圉2排放减少3%二零二六年底前范圉3排放减少3%;本集团致力在整个营运过程中善用资源，多管齐下实施节约用水及节能措施，例如鼓励倔员用后关掉灯具及空调、用水后紧闭水龙头及更有效使用纸张。本集团亦非常重视有效使用纸张，推广使用环保纸进行休闲打印及草稿，并张贴节约用纸标志，鼓励偏员更有效地使用纸张。此等措施符合本集团更广泛的可持续发展目标，显示其致力减少环境影响的决心。通过提高倔员的资源节约意识及实施有效的攀措及计划，本集团正操取积极措施促进可持续发展。"
    text = '一、本期业绩预告情况：(一)业绩预告期间。2021年1月1日至2021年12月31日。(二)业绩预告情况。1、经财务部门初步测算，洛阳建龙微纳新材料股份有限公司（以下简称“公司”）预计2021年年度实现归属于母公司所有者的净利润为27,500.00万元至29,000.00万元，与上年同期（法定披露数据）相比，将增加14,762.93万元至16,262.93万元，同比增加115.91%至127.68%。'
    text = '该单位存在无《辐射安全许可证》，从事射线装置使用活动的环境违法行为@@该单位存在无《辐射安全许可证》，从事射线装置使用活动的环境违法行为。'
    text = '2021年,飞鹤共组织2次信息安全意识及常规防护知识培训,以提升全员信息安全防护意识。'.lower()
    # text = '禅意歌者刘珂矣《一袖云》中诉知己…绵柔纯净的女声，将心中的万水千山尽意勾勒于这清素画音中'
    # text = '兴业银行。2022年3月25日，银保监罚决字(2022)22号显示，兴业银行股份有限公司存在漏报贸易融资业务EAST数据等14项违法违规事实，被中国人民银行处罚款350万元。'
    # text = """{"text": "付款确认书编号:ZB00002-20191204-0530 中山市科誉房地产发展有限公司对深圳市中建达工程项目管理有限公司之合同编号：ZS-QX-02Q-前期-0002，发票号：12585217-12585220，转让金额：386670.27元 付款确认书编号:ZB00002-20191204-0443 新疆中万火炬房地产开发有限公司对新疆卓越工程项目管理有限公司之合同编号：XJ-GYL-01Q-前期-0017，发票号：03814922-03814924，转让金额：235982.79元 付款确认书编号:ZB00002-20191204-0442 新疆中万火炬房地产开发有限公司对新疆卓越工程项目管理有限公司之合同编号：XJ-GYL-01Q-前期-0017，发票号：02321832-02321835，转让金额：379477.98元。", "event_list": [{"event_type": "动产融资", "event_text": "付款确认书编号:ZB00002-20191204-0530 中山市科誉房地产发展有限公司对深圳市中建达工程项目管理有限公司之合同编号：ZS-QX-02Q-前期-0002，发票号：12585217-12585220，转让金额：386670.27元", "arguments": []}, {"event_type": "动产融资", "event_text": "付款确认书编号:ZB00002-20191204-0443 新疆中万火炬房地产开发有限公司对新疆卓越工程项目管理有限公司之合同编号：XJ-GYL-01Q-前期-0017，发票号：03814922-03814924，转让金额：235982.79元", "arguments": []}, {"event_type": "动产融资", "event_text": "付款确认书编号:ZB00002-20191204-0442 新疆中万火炬房地产开发有限公司对新疆卓越工程项目管理有限公司之合同编号：XJ-GYL-01Q-前期-0017，发票号：02321832-02321835，转让金额：379477.98元。", "arguments": []}]}"""
    tests = []
    tests.append(text)
    results = server_test(json.dumps(tests, ensure_ascii=False))
    print(results)
    # print(json.loads(results))
    # for i in json.loads(results):
    #     print(i)
    # for i in tqdm(range(1000)):
    #    _ = server_test(text)
       # _ = server_test(json.dumps(test, ensure_ascii=False), "http://10.17.107.66:8019/prediction")

    # print(json.loads(aa))
